<?php

namespace Database\Seeders\CT;

use Illuminate\Database\Seeder;
use DB;

class AccountSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::connection('oracle_oact')->table('ptct_accounts')->insert([
            [ 'seq' => "1", 'name' => 'วัตถุดิบที่ใช้ไป'],
            [ 'seq' => "2", 'name' => 'วัตถุดิบ - คิดเข้างาน'],
            [ 'seq' => "3", 'name' => 'ค่าแรงงานทางตรง - คิดเข้างาน'],
            [ 'seq' => "4", 'name' => 'ค่าใช้จ่ายผลิตผันแปร - คิดเข้างาน'],
            [ 'seq' => "5", 'name' => 'ค่าใช้จ่ายผลิตคงที่ - คิดเข้างาน'],
            [ 'seq' => "6", 'name' => 'บัญชีพักวัตถุดิบ - คิดเข้างาน'],
            [ 'seq' => "7", 'name' => 'บัญชีพักค่าแรงทางตรง - คิดเข้างาน'],
            [ 'seq' => "8", 'name' => 'บัญชีพักค่าใช้จ่ายผลิตผันแปร - คิดเข้างาน'],
            [ 'seq' => "9", 'name' => 'บัญชีพักค่าใช้จ่ายผลิตคงที่ - คิดเข้างาน'],
            [ 'seq' => "10", "name" =>	"ผลต่างด้านปริมาณ-วัตถุดิบ"],	
            [ 'seq' => "11", "name" =>	"ผลต่างด้านประสิทธิภาพ-ค่าแรงงานทางตรง"],	
            [ 'seq' => "12", "name" =>	"ผลต่างด้านประสิทธิภาพ-ค่าใช้จ่ายในการผลิตผันแปร"],	
            [ 'seq' => "13", "name" =>	"ผลต่างด้านกำลังการผลิต-ค่าใช้จ่ายในการผลิตคงที่"],	
            [ 'seq' => "14", "name" =>	"ผลต่างด้านราคา-วัตถุดิบ"],	
            [ 'seq' => "15", "name" =>	"ผลต่างด้านอัตรา-ค่าแรงงานทางตรง"],	
            [ 'seq' => "16", "name" =>	"ผลต่างด้านการใช้จ่าย-ค่าใช้จ่ายในการผลิตผันแปร"],	
            [ 'seq' => "17", "name" =>	"ผลต่างด้านการใช้จ่าย-ค่าใช้จ่ายในการผลิตคงที่"],	
            [ 'seq' => "18", "name" =>	"สินค้าระหว่างผลิต"],
            [ 'seq' => "19", "name" =>	"วัตถุดิบ"],
            [ 'seq' => "20", 'name' =>	"WIP-STD"],	
            [ 'seq' => "21", 'name' =>	"วัตถุดิบ - มาตรฐาน"],
            [ 'seq' => "22", 'name' =>	"ค่าแรงทางตรง - มาตรฐาน"],
            [ 'seq' => "23", 'name' =>	"ค่าใช้จ่ายการผลิตผันแปร - มาตรฐาน"],
            [ 'seq' => "24", 'name' =>	"ค่าใช้จ่ายการผลิตคงที่ - มาตรฐาน"],
            [ 'seq' => "25", 'name' =>	"ค่าแรงทางตรง"],
            [ 'seq' => "26", 'name' =>	"ค่าใช้จ่ายในการผลิตคงที่"],
            [ 'seq' => "27", 'name' =>	"ค่าใช้จ่ายในการผลิตผันแปร"],
            [ 'seq' => "28", 'name' =>	"สินค้าสำเร็จรูป"],
            [ 'seq' => "29", 'name' =>	"บัญชีพักรับสินค้า"],
            [ 'seq' => "30", 'name' => "บัญชีต้นทุนขาย"	]
        ]);
    }
}
